[
  {
    "heading": "U.S. Warns Citizens to Reconsider Travel to Nigeria Over Security and Healthcare Concerns",
    "content": "By Nwaneri Uche Nigeria’s lack of healthcare services, increased rates of kidnapping, terrorism, and armed gangs have prompted the U.S. government to issue new travel advice to its nationals, warning them not to go there. With some countries designated as high-risk areas, the U.S. travel advice, released as part of its security review, acts as a reference for tourists arranging vacations to Africa. Eleven other African nations, including Somalia, Libya, Burkina Faso, South Sudan, the Democratic Republic of the Congo, Uganda, Burundi, Mauritania, Guinea-Bisau, Niger, and Chad, were also included in the advisory warning.Discover morehealthBuy vitamins and supplementsBest vacation packagesHealthEducation Level four, “do not travel,” was the most severe, and level three, “reconsider travel,” indicated a considerable risk. The advisory divided countries into four tiers. On its website, the U.S. Mission in Nigeria warned its people to reevaluate travel plans to Nigeria. According to the statement, there is a “significant security risk” at every location in Nigeria. Although citizens can still visit, the U.S. identified 18 states as most dangerous and advised its citizens to stay away from them. Due to terrorism and kidnapping, it recommended avoiding Borno, Yobe, Kogi, and northern Adamawa. It also advised staying away from Bauchi, Gombe, Kaduna, Kano, Katsina, Sokoto, and Zamfara due to kidnapping. Abia, Anambra, Bayelsa, Delta, Enugu, Imo, and Rivers states (except Port Harcourt) were also noted for crime and armed gangs.Discover moreBuy vitamins and supplementsHealthBest vacation packageshealthEducation The message warned tourists against visiting Nigeria due to armed gangs, criminality, terrorism, civil upheaval, kidnapping, and uneven medical care. Every location in Nigeria has serious security concerns, though some are riskier than others. “The nation has a high rate of violent crime, including rape, highway banditry, kidnapping, armed robbery, assault, carjacking, and hostage-taking. Kidnappings for ransom are frequent and mostly target rich U.S. citizens and dual nationals. On interstate highways, kidnapping gangs stop victims.” “Terrorist violence is a possibility in Nigeria. Terrorists are still planning and executing attacks, working with neighbourhood gangs. Targeting malls, markets, hotels, houses of religion, eateries, bars, schools, government offices, transit hubs, and public areas, they may launch attacks with little notice.”Discover morehealthBest vacation packagesHealthBuy vitamins and supplementsEducation “There are armed gangs and civil disturbances in Southern Nigeria, especially in the Southeast and Niger Delta. These regions have high rates of gang activity and armed crime, including attacks on Nigerian security forces and kidnappings.” “In rural places, conflicts between herder and farmer populations can erupt. Americans shouldn’t expect to receive the same quality of healthcare as in the U.S. Medical facilities lack the resources and equipment to meet American or European standards. Many medications are unavailable, such as those for asthma and diabetes.” “It’s essential to pack adequate prescription and over-the-counter medications. You should renew your immunisations to include polio booster, cholera, typhoid, meningitis, yellow fever, hepatitis A, and hepatitis B. Given Nigeria’s high malaria risk, all tourists should take malaria prophylactics. Hospitals frequently demand immediate cash payment for services, and counterfeit medications are prevalent. U.S. health insurance is not accepted by most physicians and hospitals. Emergency services are inadequate.”Buy vitamins and supplements “Blood supply and ambulance services are frequently unreliable, under equipped, and lack trained paramedics. Before visiting Nigeria, we strongly advise obtaining travel insurance, especially medical evacuation insurance.” Share this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation IPOB Demands Nnamdi Kanu’s Acquittal Nurses to Embark on Nationwide Strike Over Welfare Demands",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/u-s-warns-citizens-to-reconsider-travel-to-nigeria-over-security-and-healthcare-concerns/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "IPOB Demands Nnamdi Kanu’s Acquittal",
    "content": "By Nwaneri Uche The Indigenous People of Biafra (IPOB) has asked the Federal High Court in Abuja to throw out the prosecution against its leader, Mazi Nnamdi Kanu. The prosecution has not established a prima facie case against Kanu, according to the IPOB. IPOB’s Media and Publicity Secretary, Comrade Emma Powerful, issued a statement in which the group referenced a July 14, 2025, legal response filed by Chief Kanu Agabi, SAN, in response to the Federal Government’s rejection of a no-case submission from Kanu’s defence team.Discover moreEducation IPOB claimed that the defense’s arguments are supported by evidence and the constitution, calling the submission a “significant legal development.” According to them, the government hasn’t provided enough proof to move forward with the case. In the defence filing, the group emphasised a number of important points. IPOB noted that the defence overlooked some important issues, including the nature of witness testimony, the lack of forensic authentication, and the absence of direct victims. The group underlined that the prosecution’s case is severely weakened by these omissions. The defence argues that the modified audio recordings used by the prosecution were not independently confirmed. Given that the defence contends that the audio evidence is dubious, this calls into doubt the material’s admissibility. Kanu is accused of importing a transmitter, according to one of the counts against him.Discover moreEducation IPOB, however, asserts that no supporting documentation or evidence has been provided. The constitutional presumption of innocence until proven guilty and the prosecution’s burden of proof were reaffirmed in the defense’s submission. According to IPOB, some charges might have legal or procedural issues that compromise their validity. Discover moreEducationShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation Kachikwu Sparks Tension in ADC with Claims That Obi May Defect U.S. Warns Citizens to Reconsider Travel to Nigeria Over Security and Healthcare Concerns",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/ipob-demands-nnamdi-kanus-acquittal/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "Comrades Condemn Sudden Increase in Acceptance Fees",
    "content": "By David Simeon The University of Benin Comrades Community isn’t holding back. They are calling on the university management to reverse the recent hike in the acceptance fee for fresh students, describing it as unjust, surreptitious, and against the values the institution stands for. In a press released on Sunday, November 2, 2025, the student group expressed deep frustration, labelling the fee hike “arbitrary” and criticising the management for failing to inform students before the commencement of Post-UTME registration. Families had planned for one amount, only to be confronted with a sudden increase after purchasing the forms.Discover moreEducationeducationaleducation The group argued that the move disregards the harsh economic reality most Nigerian families face and breaks the trust of applicants who relied on the original fee. They maintained that public institutions should act in good faith and be transparent—especially in decisions that directly affect people financially. By keeping the fee change under wraps until after students bought their Post-UTME forms, the university, according to the group, misled applicants and trapped them into a deal under false pretences. They described it as a decision that erodes trust and reflects a lack of accountability. The students further stressed that education should not be treated as a privilege but as a right—protected under Section 18 of the 1999 Constitution. Turning it into something only the wealthy can afford, they warned, widens the gap between rich and poor. They also accused public universities of placing profit above fairness. Beyond expressing displeasure, the group demanded swift action. They called on the Minister of Education to intervene and urged Edo State Governor Godwin Obaseki to engage the university management on behalf of affected students and their families. They also appealed directly to President Bola Ahmed Tinubu to uphold the values that both the university and the nation are meant to represent.Discover moreEducationeducationeducational The Comrades Community reaffirmed their solidarity with all students and parents impacted by the new fee and demanded that the university reverse the increase immediately. Copies of their statement were sent to the Minister of Education, the Edo State Governor, and other relevant authorities. UNIBEN Comrades Community (UCC) For and on behalf of the students and prospective students of the University of Benin. Discover moreEducationeducationeducationalShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATEDiscover moreeducationeducationalEducation function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation UNIBEN Student Alleges Secret Recording and TikTok Upload Without Consent",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/comrades-condemn-sudden-increase-in-acceptance-fees/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "UNIBEN Student Alleges Secret Recording and TikTok Upload Without Consent",
    "content": "By Theophilus Chibuzo Oliver As concerns about online privacy and consent continue to grow, a student of the University of Benin has accused a recent graduate of the institution of secretly recording her and uploading the footage to TikTok without her permission, sparking legal and ethical discussions within the university community. The incident reportedly occurred on 14 October 2025, at about 4 p.m., near Festus Iyayi Hall.Discover moreVideoEducationeducationalvideoTikTokvideos Speaking with ACJ UNIBEN, Miss Victoria Ebadan recounted that she was walking towards the Faculty of Life Sciences when a young man approached her and initiated a conversation. According to her, “He walked past me, stopped, and asked me to wait. He then asked if I was familiar with places on campus. I asked where exactly he was looking for, and he replied, ‘Where I can get your number,’ which I found funny and laughed.” Miss Ebadan said she walked away, clearly demonstrating that she was not interested in continuing the conversation. However, the man followed her, asking further questions about her name and how her day was going. “I told him my name was Victoria and walked away. As I was leaving, he said, ‘Take good care,’ not knowing he was recording me with his smart glasses,” she added. The footage was later uploaded to TikTok by the user ‘David Greene’ with the caption, “Not every laugh guarantees chasin’…”. The video quickly attracted attention and generated a series of derogatory comments from viewers. Miss Ebadan said she became aware of the video when a friend informed her about it. She later confronted the individual during her sign-out celebration on 17 October 2025, demanding that he take down the post or face legal action. “He initially claimed that he was within his rights, but as people gathered around, he eventually agreed to delete it,” she said. However, he reportedly failed to comply with other demands issued through her legal counsel.Discover moreEducationeducationalVideovideovideosTikTok Following legal consultation, a formal letter was sent to the accused, outlining several demands. The letter required that he immediately and permanently remove the said video from his TikTok account, @davis_greene001, and from any other platform where it had been uploaded, with written confirmation of compliance within 24 hours. It further demanded that he provide a written undertaking not to publish or republish the video, any portion of it, or any other video of Miss Ebadan without her express written consent. In addition, the accused was instructed to issue a written apology acknowledging the distress caused by his actions, to be posted in a mutually agreed manner—such as a pinned post on his TikTok account. He was also asked to confirm whether the video had been shared, downloaded, or reposted by others, and to outline the steps he had taken to ensure its removal from all platforms. The accused has reportedly deleted the video but has not fulfilled the other demands. Miss Ebadan stated that she intends to pursue further legal action should he fail to comply fully.Discover moreTikTokVideoEducationeducationalvideosvideo When ACJ UNIBEN reached out to the accused individual for his response, he did not reply to messages seeking his side of the story as at the time of filing this report. The incident has reignited conversations on digital consent and online ethics, with students and media advocates stressing the need to seek explicit permission before recording or sharing images and videos of others on social media platforms. Share this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Discover moreTikTokeducationalvideosvideoEducationVideoSupport ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation Fee Hike: UNIBEN Warns New Students to Pay Acceptance Fee Before November 10 or Forfeit Admission Comrades Condemn Sudden Increase in Acceptance Fees",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/uniben-student-alleges-secret-recording-and-tiktok-upload-without-consent/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "Fee Hike: UNIBEN Warns New Students to Pay Acceptance Fee Before November 10 or Forfeit Admission",
    "content": "By Theophilus Chibuzo Oliver The University of Benin (UNIBEN) has issued a stern warning to newly admitted students to complete payment of their acceptance fees on or before Monday, November 10, 2025, or risk losing their admission. In a statement released on Friday, the university emphasised that admitted candidates must strictly adhere to the directive to avoid forfeiture of their admission offers.Discover moreEducationeducational Discover moreeducationalEducation “Admitted candidates are strongly advised to strictly comply with this directive, as the deadline for payment of acceptance charges is Monday, November 10, 2025. Discover moreeducationalEducationAny candidate who fails to complete the acceptance process on or before the deadline shall forfeit the admission offer, and such vacancies will be allocated to qualified candidates on the waiting list,” the statement read. The announcement comes amid concerns over recent fee adjustments in the institution, which have sparked reactions among students and parents. UNIBEN reiterated that only candidates who have paid their acceptance fees and completed other admission formalities will be recognised as bona fide students for the 2024/2025 academic session. Discover moreeducationalEducationShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Discover moreEducationeducational Post navigation UNIBEN INTRODUCES PRACTICAL AUTOMOBILE ENGINEERING TRAINING FOR STUDENTS UNIBEN Student Alleges Secret Recording and TikTok Upload Without Consent",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/fee-hike-uniben-warns-new-students-to-pay-acceptance-fee-before-november-10-or-forfeit-admission/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "UNIBEN INTRODUCES PRACTICAL AUTOMOBILE ENGINEERING TRAINING FOR STUDENTS",
    "content": "By Igbinosa Rhoda The University of Benin has commenced a specialised automobile engineering training designed to equip students with practical industry-ready skills in vehicle servicing, diagnostics, and maintenance. This was contained in a communique released on Wednesday by Dr. Benedicta Ehanire, the Public Relations Officer of the University. The programme, titled Fundamentals of Automobile Service and Periodic Maintenance Training, is an initiative of the University’s Vocational and Technical Training Programme (VTTP). It is a direct implementation of the Vice Chancellor’s Five-Point Agenda aimed at repositioning UNIBEN as a centre for vocational excellence and entrepreneurial skill development.Discover moreEducation Speaking at the official launch, the Vice Chancellor, Professor Edoba B. Omoregie, SAN, noted that modern universities must evolve beyond theory-based instruction. He emphasised that integrating vocational competencies into academic programmes is essential for preparing graduates for the realities of the job market. “The future of higher education in Nigeria is skill-driven,” he said. “Our goal is to empower students with technical expertise that enhances employability, drives innovation, and positions them as job creators rather than job seekers.” The phase of the training is targeted at undergraduate engineering students and is being facilitated by seasoned professionals and industry experts. Participants will undergo intensive hands-on sessions in automobile maintenance procedures, fault diagnosis, and modern service techniques. According to the VTTP coordinator, Professor Andrew Amenaghawon, the initiative is part of the university’s commitment to bridging the gap between academic knowledge and practical application. He commended the university management for supporting programmes that promote technical proficiency and entrepreneurial growth.Discover moreEducation The Vocational and Technical Training Programme is one of UNIBEN’s strategic vehicles for promoting youth empowerment, aligning with national objectives on capacity building and sustainable economic development. Discover moreEducationShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Discover moreEducation Post navigation UNIBEN Increases Acceptance Fees, Opens Portal for Online Clearance Fee Hike: UNIBEN Warns New Students to Pay Acceptance Fee Before November 10 or Forfeit Admission",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/uniben-introduces-practical-automobile-engineering-training-for-students/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "UNIBEN Increases Acceptance Fees, Opens Portal for Online Clearance",
    "content": "By Igbinosa Rhoda The University of Benin (UNIBEN) has officially announced an increment in its acceptance fees for newly admitted students into the 2025/2026 academic session. In the new fee structure, students in science-related faculties are now required to pay ₦122,820, while non-science students will pay ₦115,670. This marks a significant rise from the previous acceptance fees of ₦80,000 for science students and ₦60,000 for non-science students. The new rates represent an increase of over 50 percent in both categories, sparking a wave of reactions from the university community.Discover morescienceScienceEducationeducationeducational Discover moreeducationeducationalSciencescienceEducationACJ UNIBEN reports that the university, on Wednesday, officially opened its portal for the payment of acceptance fees and processing of clearance. The management directed candidates to log in to the official UNIBEN portal using their application details to complete all necessary clearance and payment procedures. Discover moreeducationscienceScienceeducationalEducationSome student stakeholders have described the move as a financial strain on students and parents. A few students, who spoke on condition of anonymity, expressed dissatisfaction, saying the increment could discourage qualified but financially constrained candidates from pursuing admission at the university. UNIBEN joins several other federal institutions that have recently reviewed their fee structures following economic adjustments across the education sector. Many students have further criticised this move as a means of mandating students to subscribe to the NELFUND programme. Share this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Discover moreeducationalscienceeducationEducationScienceExcellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Discover moreeducationeducationalEducationSciencescience Post navigation UNIBEN Announces Commencement of New Academic Programmes UNIBEN INTRODUCES PRACTICAL AUTOMOBILE ENGINEERING TRAINING FOR STUDENTS",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/uniben-increases-acceptance-fees-opens-portal-for-online-clearance/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "Comrades Condemn Sudden Increase in Acceptance Fees",
    "content": "By David Simeon The University of Benin Comrades Community isn’t holding back. They are calling on the university management to reverse the recent hike in the acceptance fee for fresh students, describing it as unjust, surreptitious, and against the values the institution stands for. In a press released on Sunday, November 2, 2025, the student group expressed deep frustration, labelling the fee hike “arbitrary” and criticising the management for failing to inform students before the commencement of Post-UTME registration. Families had planned for one amount, only to be confronted with a sudden increase after purchasing the forms.Discover moreeducationaleducationEducation The group argued that the move disregards the harsh economic reality most Nigerian families face and breaks the trust of applicants who relied on the original fee. They maintained that public institutions should act in good faith and be transparent—especially in decisions that directly affect people financially. By keeping the fee change under wraps until after students bought their Post-UTME forms, the university, according to the group, misled applicants and trapped them into a deal under false pretences. They described it as a decision that erodes trust and reflects a lack of accountability. The students further stressed that education should not be treated as a privilege but as a right—protected under Section 18 of the 1999 Constitution. Turning it into something only the wealthy can afford, they warned, widens the gap between rich and poor. They also accused public universities of placing profit above fairness. Beyond expressing displeasure, the group demanded swift action. They called on the Minister of Education to intervene and urged Edo State Governor Godwin Obaseki to engage the university management on behalf of affected students and their families. They also appealed directly to President Bola Ahmed Tinubu to uphold the values that both the university and the nation are meant to represent.Discover moreeducationEducationeducational The Comrades Community reaffirmed their solidarity with all students and parents impacted by the new fee and demanded that the university reverse the increase immediately. Copies of their statement were sent to the Minister of Education, the Edo State Governor, and other relevant authorities. UNIBEN Comrades Community (UCC) For and on behalf of the students and prospective students of the University of Benin. Discover moreeducationaleducationEducationShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATEDiscover moreEducationeducationaleducation function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation UNIBEN Student Alleges Secret Recording and TikTok Upload Without Consent",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/comrades-condemn-sudden-increase-in-acceptance-fees/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "UNIBEN Student Alleges Secret Recording and TikTok Upload Without Consent",
    "content": "By Theophilus Chibuzo Oliver As concerns about online privacy and consent continue to grow, a student of the University of Benin has accused a recent graduate of the institution of secretly recording her and uploading the footage to TikTok without her permission, sparking legal and ethical discussions within the university community. The incident reportedly occurred on 14 October 2025, at about 4 p.m., near Festus Iyayi Hall.Discover morevideoVideovideoseducationalTikTokEducation Speaking with ACJ UNIBEN, Miss Victoria Ebadan recounted that she was walking towards the Faculty of Life Sciences when a young man approached her and initiated a conversation. According to her, “He walked past me, stopped, and asked me to wait. He then asked if I was familiar with places on campus. I asked where exactly he was looking for, and he replied, ‘Where I can get your number,’ which I found funny and laughed.” Miss Ebadan said she walked away, clearly demonstrating that she was not interested in continuing the conversation. However, the man followed her, asking further questions about her name and how her day was going. “I told him my name was Victoria and walked away. As I was leaving, he said, ‘Take good care,’ not knowing he was recording me with his smart glasses,” she added. The footage was later uploaded to TikTok by the user ‘David Greene’ with the caption, “Not every laugh guarantees chasin’…”. The video quickly attracted attention and generated a series of derogatory comments from viewers. Miss Ebadan said she became aware of the video when a friend informed her about it. She later confronted the individual during her sign-out celebration on 17 October 2025, demanding that he take down the post or face legal action. “He initially claimed that he was within his rights, but as people gathered around, he eventually agreed to delete it,” she said. However, he reportedly failed to comply with other demands issued through her legal counsel.Discover moreVideoeducationalvideovideosTikTokEducation Following legal consultation, a formal letter was sent to the accused, outlining several demands. The letter required that he immediately and permanently remove the said video from his TikTok account, @davis_greene001, and from any other platform where it had been uploaded, with written confirmation of compliance within 24 hours. It further demanded that he provide a written undertaking not to publish or republish the video, any portion of it, or any other video of Miss Ebadan without her express written consent. In addition, the accused was instructed to issue a written apology acknowledging the distress caused by his actions, to be posted in a mutually agreed manner—such as a pinned post on his TikTok account. He was also asked to confirm whether the video had been shared, downloaded, or reposted by others, and to outline the steps he had taken to ensure its removal from all platforms. The accused has reportedly deleted the video but has not fulfilled the other demands. Miss Ebadan stated that she intends to pursue further legal action should he fail to comply fully.Discover morevideosVideoTikTokEducationvideoeducational When ACJ UNIBEN reached out to the accused individual for his response, he did not reply to messages seeking his side of the story as at the time of filing this report. The incident has reignited conversations on digital consent and online ethics, with students and media advocates stressing the need to seek explicit permission before recording or sharing images and videos of others on social media platforms. Share this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Discover morevideoVideoEducationTikTokeducationalvideosLike this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation Fee Hike: UNIBEN Warns New Students to Pay Acceptance Fee Before November 10 or Forfeit Admission Comrades Condemn Sudden Increase in Acceptance Fees",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/uniben-student-alleges-secret-recording-and-tiktok-upload-without-consent/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "Fee Hike: UNIBEN Warns New Students to Pay Acceptance Fee Before November 10 or Forfeit Admission",
    "content": "By Theophilus Chibuzo Oliver The University of Benin (UNIBEN) has issued a stern warning to newly admitted students to complete payment of their acceptance fees on or before Monday, November 10, 2025, or risk losing their admission. In a statement released on Friday, the university emphasised that admitted candidates must strictly adhere to the directive to avoid forfeiture of their admission offers.Discover moreeducationalEducation Discover moreeducationalEducation “Admitted candidates are strongly advised to strictly comply with this directive, as the deadline for payment of acceptance charges is Monday, November 10, 2025. Discover moreEducationeducationalAny candidate who fails to complete the acceptance process on or before the deadline shall forfeit the admission offer, and such vacancies will be allocated to qualified candidates on the waiting list,” the statement read. The announcement comes amid concerns over recent fee adjustments in the institution, which have sparked reactions among students and parents. UNIBEN reiterated that only candidates who have paid their acceptance fees and completed other admission formalities will be recognised as bona fide students for the 2024/2025 academic session. Discover moreeducationalEducationShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Discover moreeducationalEducation Post navigation UNIBEN INTRODUCES PRACTICAL AUTOMOBILE ENGINEERING TRAINING FOR STUDENTS UNIBEN Student Alleges Secret Recording and TikTok Upload Without Consent",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/fee-hike-uniben-warns-new-students-to-pay-acceptance-fee-before-november-10-or-forfeit-admission/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "UNIBEN INTRODUCES PRACTICAL AUTOMOBILE ENGINEERING TRAINING FOR STUDENTS",
    "content": "By Igbinosa Rhoda The University of Benin has commenced a specialised automobile engineering training designed to equip students with practical industry-ready skills in vehicle servicing, diagnostics, and maintenance. This was contained in a communique released on Wednesday by Dr. Benedicta Ehanire, the Public Relations Officer of the University. The programme, titled Fundamentals of Automobile Service and Periodic Maintenance Training, is an initiative of the University’s Vocational and Technical Training Programme (VTTP). It is a direct implementation of the Vice Chancellor’s Five-Point Agenda aimed at repositioning UNIBEN as a centre for vocational excellence and entrepreneurial skill development.Discover moreEducation Speaking at the official launch, the Vice Chancellor, Professor Edoba B. Omoregie, SAN, noted that modern universities must evolve beyond theory-based instruction. He emphasised that integrating vocational competencies into academic programmes is essential for preparing graduates for the realities of the job market. “The future of higher education in Nigeria is skill-driven,” he said. “Our goal is to empower students with technical expertise that enhances employability, drives innovation, and positions them as job creators rather than job seekers.” The phase of the training is targeted at undergraduate engineering students and is being facilitated by seasoned professionals and industry experts. Participants will undergo intensive hands-on sessions in automobile maintenance procedures, fault diagnosis, and modern service techniques. According to the VTTP coordinator, Professor Andrew Amenaghawon, the initiative is part of the university’s commitment to bridging the gap between academic knowledge and practical application. He commended the university management for supporting programmes that promote technical proficiency and entrepreneurial growth.Discover moreEducation The Vocational and Technical Training Programme is one of UNIBEN’s strategic vehicles for promoting youth empowerment, aligning with national objectives on capacity building and sustainable economic development. Discover moreEducationShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Discover moreEducation Post navigation UNIBEN Increases Acceptance Fees, Opens Portal for Online Clearance Fee Hike: UNIBEN Warns New Students to Pay Acceptance Fee Before November 10 or Forfeit Admission",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/uniben-introduces-practical-automobile-engineering-training-for-students/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "ASUU : FG moves to end strike, agrees to pay N34bn minimum wage arrears to ASUU, NASU and COEASU",
    "content": "– begs ASUU to suspend strike By O.V Collins After 99days of a total and comprehensive industrial action by the Academic Staff Union of Universities (ASUU) and days of disappointing halt in academic activities in tertiary institutions across the nation, the Federal Government Tuesday said it would spend about N34 billion on the ongoing payment of minimum wage consequential adjustments to workers in the education sector with effect from 2019. The beneficiaries of this payment are members of the striking Academic Staff Union of Universities (ASUU) and their compeer in the polytechnics and Colleges of Education.Discover moreEducation This was revealed by the Minister of Labour and Employment, Senator Chris Ngige while responding to questions from labour correspondents in Abuja on the ASUU strike which has now become prolonged. According to the minister, the N34billion would be split among the various educational bodies with universities getting N23.5 billion, while the polytechnics will receive N6 billion and the Colleges of Education receives N4 billion. Commenting on the ASUU strike, Ngige stated the committees set up during the last tripartite and meeting between the Federal Government and tertiary Institution-based unions were given 14-days to submit their report and they are still on the task which are expected to produce results this weekend. “Those committees are working. The one on NITDA is testing the three platforms, the government’s Integrated Personnel and Payroll Information System (IPPIS), the ASUU University Transparency Accountability Solution (UTAS) and the Universities Peculiar Personnel Payroll System (U3PS) of the non-teaching staff”, Ngige said.Discover moreEducation “They started the testing last Thursday. The National Salaries, Wages and Incomes Commission (NSWIC) has issued their amendment circulars. The unions also have copies to take care of responsibility and hazard allowances wherever it has not been properly captured,” He added. He confirmed that there may be likely wage adjustments as the federal government augments efforts to streamline wages through the National Salaries, Incomes and Wages Commission. In addition, he stated, “We have done police for example. It wasn’t envisaged that we should do it in pockets. But you can see that police has been done. You can also see university teachers saying that their own should be done immediately, since we have done police. “So, something is being done. It was part of the 2009 negotiation they had with the government then. So, the committee of Prof. Briggs is on it, discussing with the university unions and their employer, the Federal Ministry of Education. They will bring up something for government to see.Discover moreEducation “There are other people. The doctors are complaining about brain drain, this and that. Their hazard allowance has to be touched and it was touched by close to 300 percent. From N5000 paid across board for each person, the least person in the health sector is getting N15000 while the big ones are getting N45000. So, that is the quantum leap.” Finally, the minister reiterated his appeal to ASUU and other tertiary Institution-based unions to suspend their strike to enable academic activities resume once again in tertiary institutions across the Nation. LATEST: Comrades Condemn Sudden Increase in Acceptance Fees UNIBEN Student Alleges Secret Recording and TikTok Upload Without Consent Fee Hike: UNIBEN Warns New Students to Pay Acceptance Fee Before November 10 or Forfeit Admission Discover moreEducationShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation NUCJ’22: National Union of Campus Journalists (NUCJ), Nigeria Electoral Committee Announces Lift of Electoral Ban, Begins Processes For Union’s National Elections There is no need to call off strike as N34bn released by FG not part of our demands – ASUU There is no need to call off strike as N34bn released by FG not part of our demands – ASUU – The ACJ UNIBEN says: May 26, 2022 at 12:42 PM […] reports that the federal government had on Tuesday released N34 billion for the payment of consequential adjustment for minimum wage of workers in the education […] Reply ASUP calls off strike, directs lecturers to resume work May 30 – The ACJ UNIBEN says: May 28, 2022 at 3:06 PM […] had reported earlier that the Nigerian Government commenced the disbursement of the minimum wage arrears to both lecturers of polytechnics, university lecturers and other tertiary institution workers […] Reply",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/asuu-fg-moves-to-end-strike-agrees-to-pay-n34bn-minimum-wage-arrears-to-asuu-nasu-and-coeasu/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "UNIBEN Management Set Up Panel Of Inquiry To Look Into The Hall 1 Girls Protest Held On February 5th, 2022",
    "content": "By Gabriella Jese & Crystal Grace The cause of the protest held by some residents of Hall 1 was as a result of the insecurity in the residence. According to the hostelites, successive robbery attacks have been carried out in the Halls of Residence since September 2021, and adequate measures to prevent these thefts from externals and intruders were not done properly. The protest staged on 5th February 2022, was directed at alerting the Vice Chancellor about the issue. In the words of one of the protesters: “we said maybe mama VC has not heard about it, and so we have come to tell her…”ACJ-UNIBEN reported that the enraged girls were dispersed as soon as they blocked the main gate of the school on that day, after which corrective measures were put in place to solve the security issue.Discover moreEducationSchool supplieseducational However, the panel of inquiry set up by the Vice Chancellor to look into the Protest remains a bone of contention. Why should the students be summoned? Is there any need for further clarifications? Today, 11th February 2021, makes it the third day various Hall 1 residents have been summoned and questioned by the VC’s Ad-Hoc committee. One of the six (6) students who happened to be from the faculty of School of Basic Medical Sciences (BAMSA) came along with about eight (8) faculty excos; for fear of danger, she said. Also present, was the New Dean of Students, Prof. Clement Ighodaro. Already, the S.U.G President, Comrade Foster Amadin, had been in attendance for the first two days of the investigation, and was also present today. “I have been following the matter judiciously,” Foster said, “and I promise that no student will be victimized.” When the BAMSA student emerged from the conference room, her excos immediately enclosed her. She reported that she didn’t find the interrogation harmful in any way. Still unsatisfied with the nature of the inquiry, the excos approached the New Dean to state their complains. Prof Clement tried to reassure them of a fair-play-investigation. The excos remained unsatisfied, and sat outside to see to the end of the day’s investigation.Discover moreSchool suppliesEducationeducational At the moment, the outcome of the Inquiry remains unknown: the students involved are relatively calm and hopeful. Discover moreSchool supplieseducationalEducationShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Discover moreEducationSchool supplieseducational Post navigation UNIBEN SUG Sensitizes Students On Security Strike Update: ASUU NEC to announce decision on Monday, changes meeting venue over fear of bugging by secret agents of the Nigerian government. Lawal biodun says: February 12, 2022 at 8:32 AM Send updates plz Reply acjuniben says: February 12, 2022 at 8:35 AM We definitely will. Reply",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/uniben-management-set-up-panel-of-inquiry-to-look-into-the-hall-1-girls-protest-held-on-february-5th-2022/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "UNIBEN: Hall 1 Girls Protest Insecurity On Campus, Block Main Gate",
    "content": "The residents of the school hostel have expressed their displeasure about the state of security in the hostels. This, following as a result of a case of theft and an attack on a student in the early hours of today, Saturday, 5th of February, 2022. As at 3am this morning, a girl in “Hall 1; Block E” came outside from her apartment to urinate. She came across a man who had broken into the hostel to steal. In fears that she might expose him, the thief attacked her, strangling her in the process. Her screams woke up other hostelites who came to her rescue only for the man to escape from the scene of the incident. The lady was rushed to the school’s health centre for her to receive treatment and recover from the shock.Discover moreEducation Discover moreEducationAs at 7:30am this morning, the girls in the hostels collectively marched to the VC’s lodge where they met the Dean of Students, H.O.D of Foreign Languages who is also the Director of Environmental and Hostel matters in UNIBEN and some SUG executives who tried to calm down the girls. Hostelites marching to the VC’s lodge Hostelites marching to the VC’s lodge “Anytime things like this happen, we make sure we report it and pass through due protocols. We’ve gone to the right authorities but still, nothing has been done. Now that this has happened, even the Dean of Students came to the hostel and told us to calm down but we said NO. If mummy (the VC) has been hearing of this matter and she has not done anything about it, it means she has not heard it. So we have decided to come here to tell her ourselves so she can hear it from our voice and we’ll know that she has listened to us with her ears so she will do something about it, because if nothing is done today, tomorrow we are coming back with our loads. We’ll come and stay in her lodge. We’ll sleep here. Enough is enough!”, one of the girls cried painfully. A UNIBEN student complaining to the H.O.D of Foreign Languages who is also the Director of Environmental and Hostel matters in UNIBEN The H.O.D told the girls that the issue will be worked on and that the girls should stay calm. She said by 9:30am today, the management would start working on raising the fence. She also mentioned that this is the first time this sort of issue was getting to the VC’s office. Sources confirmed that the hostel has been robbed up to 5 times including last semester and several complaints have been made but all to no avail.Discover moreEducation The girls, resistant to the words of the Dean and S.U.G officials, decided to march to Main Gate and lock it until action was taken by the school management. Hostel Girls marching to block UNIBEN main gate Soon after they blocked Main Gate, some SUG officials came angrily, inciting fear into the girls and successfully chased them away from the gate.The crowd dispersed and the girls went back to their hostel. As at the time of filing this report, campus journalists reported that bricks have been brought to the hostel walls and work to raise the fences was about to start. Share this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation LET’S GO TO UNIBEN NUESA DEAN’s Cup: DEF Kicks Off Training UNIBEN Management Set Up Panel Of Inquiry To Look Into The Hall 1 Girls Protest Held On February 5th, 2022 – The ACJ UNIBEN says: February 11, 2022 at 11:05 PM […] said maybe mama VC has not heard about it, and so we have come to tell her…”ACJ-UNIBEN reported that the enraged girls were dispersed as soon as they blocked the main gate of the school on that […] Reply UNIBEN: Three More Theft Cases In Less Than A Week, Hall 2 Girls Lament In Fear And Anger – The ACJ UNIBEN says: February 22, 2022 at 11:20 AM […] READ ALSO: UNIBEN: Hall 1 Girls Protest Insecurity On Campus, Block Main Gate […] Reply",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/uniben-hall-1-girls-protest-insecurity-on-campus-block-main-gate/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "ASUU: WHAT SHALL BE THE END? WILL HISTORY BE BORN AGAIN?",
    "content": "By Adejesu It has become a norm in history for Academic Staff Union of Universities(ASUU) to cause a breach in academic activities in Nigeria, holding to the fact that Federal Government kept promising and failing them. This causes huge damage to none but Nigerian students, as this serves as a waste of time, causing negative effects on aims and ambitions of students. Since 1999, if there was anything that has been very consistent in the Nigerian academic calendar of the Nigerian Universities, it is the ASUU and Federal Government at loggerheads. Not long after Nigerians ushered in democracy, a government that promised to be for the people, ending military regime in 1999; that the students experienced a disruption in their academic pursuit which lasted for 5 months. In 2001, ASUU declared another strike for 3 months, owing to the fact that Chief Olusegun Obasanjo described Nigerian university lecturers as “a bunch of lazy and ungrateful people” and for reinstatement of 49 lecturers sacked in UNILORIN. Another two weeks strike under Obasanjo administration again, was embarked on , on Sunday Dec., 2002. Gradually, the act of ASUU causing a breach in the academic activities of Nigerian Universities began to leave it’s mark on the sands of time as this act continued as follows: 2003 – 6 months strike caused by unimplementation of the previous agreements.2005 – 2 weeks strike2006 – 3-day warning strike as at April 2006 which lasted for one week.2007 – On March 26, which lasted for 3 months based on the previous reasons.2008 – One week strike. Their demands: improved salary scheme and reinstatement of 49 lecturers who were dismissed at UNILORIN.2009 – This time, it was for 4 months, from June until October.2010 – 5 months. 22nd of July – January 2011. Since federal government failed to honour it’s 2009 agreement to adequately fund the universities in the country and implement the 70-year retirement age limit for ASUU members, the union paralyzed academic activities again in Dec 2011 which lasted for 59 days and was called of in 2012.2013 – July 1 – Dec 17, 5 month, 15 days strike.2017 – Aug 17 – Sept 2017.2018 – An indefinite nationwide strike on Sunday Nov 4, 2018.2020 – 9 months strike.2022 – Feb 14, 4 weeks warning strike. Demands: failure to execute MOU, payment of Academic staff allowance, review of the payment system and case of establishment of many universities for the country. However, ASUU claim the FG owe 1.2 trillion to them and according to Dr Chris Minister of Labour and employment, FG have paid over 92 billion. Can this stop history from repeating itself? For how long will this continue? Nigerian students are seen on the street in different states including the FCT, Jos, Ebonyi, Benin, Oyo, Ibadan, Calabar, Osun, Minna, and Awka just to mention a few; clamouring in response to the attitude of Federal Government towards ASUU’s demands. READ ALSO: Uniben Students Protest ASUU Strike, Halt Activities Along Benin-Lagos Road As of now, the minister of education explained that some of the stated items of ASUU in the 2019 agreement are unrealistic and unimplementable and ASUU has been duly informed. This the implementable document which has been drafted and submitted to the government will be signed by the FG and ASUU to put a permanent end to ASUU strike. “We shall react louder and bigger across the 36 States and the FCT should the government fail to find a permanent solution to the issues of ASUU strike” NANS president said to the Minister of Education. Share this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation UNIBEN: LET THERE BE LIGHT SECURITY TIPS FOR STUDENTS eloedu says: March 2, 2022 at 4:19 PM … Aside the usual festival of strike, I am guessing that there are other ways ASUU can generate money to meet their needs Reply eloedu says: March 2, 2022 at 5:14 PM Well documented Reply",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/asuu-what-shall-be-the-end-will-history-be-born-again/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "Comrades Condemn Sudden Increase in Acceptance Fees",
    "content": "By David Simeon The University of Benin Comrades Community isn’t holding back. They are calling on the university management to reverse the recent hike in the acceptance fee for fresh students, describing it as unjust, surreptitious, and against the values the institution stands for. In a press released on Sunday, November 2, 2025, the student group expressed deep frustration, labelling the fee hike “arbitrary” and criticising the management for failing to inform students before the commencement of Post-UTME registration. Families had planned for one amount, only to be confronted with a sudden increase after purchasing the forms.Discover moreEducationeducationaleducation The group argued that the move disregards the harsh economic reality most Nigerian families face and breaks the trust of applicants who relied on the original fee. They maintained that public institutions should act in good faith and be transparent—especially in decisions that directly affect people financially. By keeping the fee change under wraps until after students bought their Post-UTME forms, the university, according to the group, misled applicants and trapped them into a deal under false pretences. They described it as a decision that erodes trust and reflects a lack of accountability. The students further stressed that education should not be treated as a privilege but as a right—protected under Section 18 of the 1999 Constitution. Turning it into something only the wealthy can afford, they warned, widens the gap between rich and poor. They also accused public universities of placing profit above fairness. Beyond expressing displeasure, the group demanded swift action. They called on the Minister of Education to intervene and urged Edo State Governor Godwin Obaseki to engage the university management on behalf of affected students and their families. They also appealed directly to President Bola Ahmed Tinubu to uphold the values that both the university and the nation are meant to represent.Discover moreeducationeducationalEducation The Comrades Community reaffirmed their solidarity with all students and parents impacted by the new fee and demanded that the university reverse the increase immediately. Copies of their statement were sent to the Minister of Education, the Edo State Governor, and other relevant authorities. UNIBEN Comrades Community (UCC) For and on behalf of the students and prospective students of the University of Benin. Discover moreeducationaleducationEducationShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATEDiscover moreeducationeducationalEducation function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation UNIBEN Student Alleges Secret Recording and TikTok Upload Without Consent",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/comrades-condemn-sudden-increase-in-acceptance-fees/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "Fee Hike: UNIBEN Warns New Students to Pay Acceptance Fee Before November 10 or Forfeit Admission",
    "content": "By Theophilus Chibuzo Oliver The University of Benin (UNIBEN) has issued a stern warning to newly admitted students to complete payment of their acceptance fees on or before Monday, November 10, 2025, or risk losing their admission. In a statement released on Friday, the university emphasised that admitted candidates must strictly adhere to the directive to avoid forfeiture of their admission offers.Discover moreeducationalEducation Discover moreeducationalEducation “Admitted candidates are strongly advised to strictly comply with this directive, as the deadline for payment of acceptance charges is Monday, November 10, 2025. Discover moreeducationalEducationAny candidate who fails to complete the acceptance process on or before the deadline shall forfeit the admission offer, and such vacancies will be allocated to qualified candidates on the waiting list,” the statement read. The announcement comes amid concerns over recent fee adjustments in the institution, which have sparked reactions among students and parents. UNIBEN reiterated that only candidates who have paid their acceptance fees and completed other admission formalities will be recognised as bona fide students for the 2024/2025 academic session. Discover moreEducationeducationalShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Discover moreEducationeducational Post navigation UNIBEN INTRODUCES PRACTICAL AUTOMOBILE ENGINEERING TRAINING FOR STUDENTS UNIBEN Student Alleges Secret Recording and TikTok Upload Without Consent",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/fee-hike-uniben-warns-new-students-to-pay-acceptance-fee-before-november-10-or-forfeit-admission/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "UNIBEN Increases Acceptance Fees, Opens Portal for Online Clearance",
    "content": "By Igbinosa Rhoda The University of Benin (UNIBEN) has officially announced an increment in its acceptance fees for newly admitted students into the 2025/2026 academic session. In the new fee structure, students in science-related faculties are now required to pay ₦122,820, while non-science students will pay ₦115,670. This marks a significant rise from the previous acceptance fees of ₦80,000 for science students and ₦60,000 for non-science students. The new rates represent an increase of over 50 percent in both categories, sparking a wave of reactions from the university community.Discover moreSciencescienceEducationeducationaleducation Discover moreEducationScienceeducationaleducationscienceACJ UNIBEN reports that the university, on Wednesday, officially opened its portal for the payment of acceptance fees and processing of clearance. The management directed candidates to log in to the official UNIBEN portal using their application details to complete all necessary clearance and payment procedures. Discover morescienceScienceEducationeducationeducationalSome student stakeholders have described the move as a financial strain on students and parents. A few students, who spoke on condition of anonymity, expressed dissatisfaction, saying the increment could discourage qualified but financially constrained candidates from pursuing admission at the university. UNIBEN joins several other federal institutions that have recently reviewed their fee structures following economic adjustments across the education sector. Many students have further criticised this move as a means of mandating students to subscribe to the NELFUND programme. Share this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Discover moreScienceeducationeducationalEducationscienceExcellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Discover moreScienceeducationalEducationeducationscience Post navigation UNIBEN Announces Commencement of New Academic Programmes UNIBEN INTRODUCES PRACTICAL AUTOMOBILE ENGINEERING TRAINING FOR STUDENTS",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/uniben-increases-acceptance-fees-opens-portal-for-online-clearance/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "UNIBEN Announces Commencement of New Academic Programmes",
    "content": "By Funmilayo Bayo The University of Benin (UNIBEN) on Monday, 20th October 2025, officially announced the introduction of several new academic programmes set to commence in the 2025/2026 academic session. This development follows the successful resource verification exercise conducted by the National Universities Commission (NUC).Discover moreEducation Discover moreEducationIn an official statement signed by Professor Joseph Osemwenkhae, Director of Academic Planning, the University disclosed that a total of fifteen new programmes have been approved for prospective students and the general public. Discover moreEducationThe newly introduced programmes include: B.Sc. Data Science Doctor of Physiotherapy (DPT) B.Sc. Broadcasting B.Sc. Advertising B.Sc. Peace and Conflict Resolution Discover moreEducationB.Sc. Film and Multimedia Studies B.Sc. Information and Communication Technology B.Sc. Software Engineering B.Sc. Information Technology B.Sc. Public Relations B.Sc. Cyber Security B.Sc. Development Studies B.Sc. Public Health B.Agric. (Agricultural Economics) B.Agric. (Agricultural Extension and Rural Development) The University’s management encouraged prospective students, members of the university community, and the general public to take advantage of this opportunity, describing it as a significant step towards academic expansion and innovation at UNIBEN. Share this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation UNIBEN REVIVES BLOCK MOLDING FACTORY TO BOOST INNOVATION AND REVENUE GENERATION UNIBEN Increases Acceptance Fees, Opens Portal for Online Clearance",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/uniben-announces-commencement-of-new-academic-programmes/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "Comrades Condemn Sudden Increase in Acceptance Fees",
    "content": "By David Simeon The University of Benin Comrades Community isn’t holding back. They are calling on the university management to reverse the recent hike in the acceptance fee for fresh students, describing it as unjust, surreptitious, and against the values the institution stands for. In a press released on Sunday, November 2, 2025, the student group expressed deep frustration, labelling the fee hike “arbitrary” and criticising the management for failing to inform students before the commencement of Post-UTME registration. Families had planned for one amount, only to be confronted with a sudden increase after purchasing the forms. The group argued that the move disregards the harsh economic reality most Nigerian families face and breaks the trust of applicants who relied on the original fee. They maintained that public institutions should act in good faith and be transparent—especially in decisions that directly affect people financially. By keeping the fee change under wraps until after students bought their Post-UTME forms, the university, according to the group, misled applicants and trapped them into a deal under false pretences. They described it as a decision that erodes trust and reflects a lack of accountability. The students further stressed that education should not be treated as a privilege but as a right—protected under Section 18 of the 1999 Constitution. Turning it into something only the wealthy can afford, they warned, widens the gap between rich and poor. They also accused public universities of placing profit above fairness. Beyond expressing displeasure, the group demanded swift action. They called on the Minister of Education to intervene and urged Edo State Governor Godwin Obaseki to engage the university management on behalf of affected students and their families. They also appealed directly to President Bola Ahmed Tinubu to uphold the values that both the university and the nation are meant to represent. The Comrades Community reaffirmed their solidarity with all students and parents impacted by the new fee and demanded that the university reverse the increase immediately. Copies of their statement were sent to the Minister of Education, the Edo State Governor, and other relevant authorities. UNIBEN Comrades Community (UCC) For and on behalf of the students and prospective students of the University of Benin. Share this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation UNIBEN Student Alleges Secret Recording and TikTok Upload Without Consent",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/comrades-condemn-sudden-increase-in-acceptance-fees/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "UNIBEN Student Alleges Secret Recording and TikTok Upload Without Consent",
    "content": "By Theophilus Chibuzo Oliver As concerns about online privacy and consent continue to grow, a student of the University of Benin has accused a recent graduate of the institution of secretly recording her and uploading the footage to TikTok without her permission, sparking legal and ethical discussions within the university community. The incident reportedly occurred on 14 October 2025, at about 4 p.m., near Festus Iyayi Hall. Speaking with ACJ UNIBEN, Miss Victoria Ebadan recounted that she was walking towards the Faculty of Life Sciences when a young man approached her and initiated a conversation. According to her, “He walked past me, stopped, and asked me to wait. He then asked if I was familiar with places on campus. I asked where exactly he was looking for, and he replied, ‘Where I can get your number,’ which I found funny and laughed.” Miss Ebadan said she walked away, clearly demonstrating that she was not interested in continuing the conversation. However, the man followed her, asking further questions about her name and how her day was going. “I told him my name was Victoria and walked away. As I was leaving, he said, ‘Take good care,’ not knowing he was recording me with his smart glasses,” she added. The footage was later uploaded to TikTok by the user ‘David Greene’ with the caption, “Not every laugh guarantees chasin’…”. The video quickly attracted attention and generated a series of derogatory comments from viewers. Miss Ebadan said she became aware of the video when a friend informed her about it. She later confronted the individual during her sign-out celebration on 17 October 2025, demanding that he take down the post or face legal action. “He initially claimed that he was within his rights, but as people gathered around, he eventually agreed to delete it,” she said. However, he reportedly failed to comply with other demands issued through her legal counsel. Following legal consultation, a formal letter was sent to the accused, outlining several demands. The letter required that he immediately and permanently remove the said video from his TikTok account, @davis_greene001, and from any other platform where it had been uploaded, with written confirmation of compliance within 24 hours. It further demanded that he provide a written undertaking not to publish or republish the video, any portion of it, or any other video of Miss Ebadan without her express written consent. In addition, the accused was instructed to issue a written apology acknowledging the distress caused by his actions, to be posted in a mutually agreed manner—such as a pinned post on his TikTok account. He was also asked to confirm whether the video had been shared, downloaded, or reposted by others, and to outline the steps he had taken to ensure its removal from all platforms. The accused has reportedly deleted the video but has not fulfilled the other demands. Miss Ebadan stated that she intends to pursue further legal action should he fail to comply fully. When ACJ UNIBEN reached out to the accused individual for his response, he did not reply to messages seeking his side of the story as at the time of filing this report. The incident has reignited conversations on digital consent and online ethics, with students and media advocates stressing the need to seek explicit permission before recording or sharing images and videos of others on social media platforms. Share this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation Fee Hike: UNIBEN Warns New Students to Pay Acceptance Fee Before November 10 or Forfeit Admission Comrades Condemn Sudden Increase in Acceptance Fees",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/uniben-student-alleges-secret-recording-and-tiktok-upload-without-consent/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "Fee Hike: UNIBEN Warns New Students to Pay Acceptance Fee Before November 10 or Forfeit Admission",
    "content": "By Theophilus Chibuzo Oliver The University of Benin (UNIBEN) has issued a stern warning to newly admitted students to complete payment of their acceptance fees on or before Monday, November 10, 2025, or risk losing their admission. In a statement released on Friday, the university emphasised that admitted candidates must strictly adhere to the directive to avoid forfeiture of their admission offers.Discover moreEducationeducational Discover moreeducationalEducation “Admitted candidates are strongly advised to strictly comply with this directive, as the deadline for payment of acceptance charges is Monday, November 10, 2025. Discover moreEducationeducationalAny candidate who fails to complete the acceptance process on or before the deadline shall forfeit the admission offer, and such vacancies will be allocated to qualified candidates on the waiting list,” the statement read. The announcement comes amid concerns over recent fee adjustments in the institution, which have sparked reactions among students and parents. UNIBEN reiterated that only candidates who have paid their acceptance fees and completed other admission formalities will be recognised as bona fide students for the 2024/2025 academic session. Discover moreeducationalEducationShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Discover moreEducationeducational Post navigation UNIBEN INTRODUCES PRACTICAL AUTOMOBILE ENGINEERING TRAINING FOR STUDENTS UNIBEN Student Alleges Secret Recording and TikTok Upload Without Consent",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/fee-hike-uniben-warns-new-students-to-pay-acceptance-fee-before-november-10-or-forfeit-admission/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "UNIBEN INTRODUCES PRACTICAL AUTOMOBILE ENGINEERING TRAINING FOR STUDENTS",
    "content": "By Igbinosa Rhoda The University of Benin has commenced a specialised automobile engineering training designed to equip students with practical industry-ready skills in vehicle servicing, diagnostics, and maintenance. This was contained in a communique released on Wednesday by Dr. Benedicta Ehanire, the Public Relations Officer of the University. The programme, titled Fundamentals of Automobile Service and Periodic Maintenance Training, is an initiative of the University’s Vocational and Technical Training Programme (VTTP). It is a direct implementation of the Vice Chancellor’s Five-Point Agenda aimed at repositioning UNIBEN as a centre for vocational excellence and entrepreneurial skill development.Discover moreEducation Speaking at the official launch, the Vice Chancellor, Professor Edoba B. Omoregie, SAN, noted that modern universities must evolve beyond theory-based instruction. He emphasised that integrating vocational competencies into academic programmes is essential for preparing graduates for the realities of the job market. “The future of higher education in Nigeria is skill-driven,” he said. “Our goal is to empower students with technical expertise that enhances employability, drives innovation, and positions them as job creators rather than job seekers.” The phase of the training is targeted at undergraduate engineering students and is being facilitated by seasoned professionals and industry experts. Participants will undergo intensive hands-on sessions in automobile maintenance procedures, fault diagnosis, and modern service techniques. According to the VTTP coordinator, Professor Andrew Amenaghawon, the initiative is part of the university’s commitment to bridging the gap between academic knowledge and practical application. He commended the university management for supporting programmes that promote technical proficiency and entrepreneurial growth.Discover moreEducation The Vocational and Technical Training Programme is one of UNIBEN’s strategic vehicles for promoting youth empowerment, aligning with national objectives on capacity building and sustainable economic development. Discover moreEducationShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Discover moreEducation Post navigation UNIBEN Increases Acceptance Fees, Opens Portal for Online Clearance Fee Hike: UNIBEN Warns New Students to Pay Acceptance Fee Before November 10 or Forfeit Admission",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/uniben-introduces-practical-automobile-engineering-training-for-students/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "UNIBEN Increases Acceptance Fees, Opens Portal for Online Clearance",
    "content": "By Igbinosa Rhoda The University of Benin (UNIBEN) has officially announced an increment in its acceptance fees for newly admitted students into the 2025/2026 academic session. In the new fee structure, students in science-related faculties are now required to pay ₦122,820, while non-science students will pay ₦115,670. This marks a significant rise from the previous acceptance fees of ₦80,000 for science students and ₦60,000 for non-science students. The new rates represent an increase of over 50 percent in both categories, sparking a wave of reactions from the university community.Discover moreEducationSciencescienceeducationaleducation Discover moreeducationEducationeducationalscienceScienceACJ UNIBEN reports that the university, on Wednesday, officially opened its portal for the payment of acceptance fees and processing of clearance. The management directed candidates to log in to the official UNIBEN portal using their application details to complete all necessary clearance and payment procedures. Discover morescienceeducationEducationScienceeducationalSome student stakeholders have described the move as a financial strain on students and parents. A few students, who spoke on condition of anonymity, expressed dissatisfaction, saying the increment could discourage qualified but financially constrained candidates from pursuing admission at the university. UNIBEN joins several other federal institutions that have recently reviewed their fee structures following economic adjustments across the education sector. Many students have further criticised this move as a means of mandating students to subscribe to the NELFUND programme. Share this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Discover moreeducationaleducationEducationscienceScienceExcellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Discover morescienceScienceEducationeducationeducational Post navigation UNIBEN Announces Commencement of New Academic Programmes UNIBEN INTRODUCES PRACTICAL AUTOMOBILE ENGINEERING TRAINING FOR STUDENTS",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/uniben-increases-acceptance-fees-opens-portal-for-online-clearance/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "UNIBEN Announces Commencement of New Academic Programmes",
    "content": "By Funmilayo Bayo The University of Benin (UNIBEN) on Monday, 20th October 2025, officially announced the introduction of several new academic programmes set to commence in the 2025/2026 academic session. This development follows the successful resource verification exercise conducted by the National Universities Commission (NUC).Discover moreEducation Discover moreEducationIn an official statement signed by Professor Joseph Osemwenkhae, Director of Academic Planning, the University disclosed that a total of fifteen new programmes have been approved for prospective students and the general public. Discover moreEducationThe newly introduced programmes include: B.Sc. Data Science Doctor of Physiotherapy (DPT) B.Sc. Broadcasting B.Sc. Advertising B.Sc. Peace and Conflict Resolution Discover moreEducationB.Sc. Film and Multimedia Studies B.Sc. Information and Communication Technology B.Sc. Software Engineering B.Sc. Information Technology B.Sc. Public Relations B.Sc. Cyber Security B.Sc. Development Studies B.Sc. Public Health B.Agric. (Agricultural Economics) B.Agric. (Agricultural Extension and Rural Development) The University’s management encouraged prospective students, members of the university community, and the general public to take advantage of this opportunity, describing it as a significant step towards academic expansion and innovation at UNIBEN. Share this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation UNIBEN REVIVES BLOCK MOLDING FACTORY TO BOOST INNOVATION AND REVENUE GENERATION UNIBEN Increases Acceptance Fees, Opens Portal for Online Clearance",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/uniben-announces-commencement-of-new-academic-programmes/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "UNIBEN Announces Commencement of 2025/2026 Inter-Faculty and Inter-Departmental Transfer Applications",
    "content": "By Igbinosa Rhoda The University of Benin (UNIBEN) has announced the commencement of sales of forms for the 2025/2026 Inter-Faculty and Inter-Departmental Transfer for both full-time and part-time students. According to the official statement, interested students are to pay a non-refundable fee of ₦60,000 (Sixty Thousand Naira) through the Remita online payment platform. After generating the Remita printout, applicants are required to visit the Bursary (Cash Office) for payment confirmation and then proceed to the Investment Department, also within the Bursary, where the payment will be converted into an official UNIBEN receipt.Discover moreEducation Following this, applicants are to visit the University’s official website — www.uniben.edu — to download the transfer application form. The completed form must be accompanied by the following documents: – Original UNIBEN receipt of payment – Photocopy of O’ Level Certificate or Statement of Result – Passport photograph with a red background Applicants are advised to make a duplicate copy of the completed form before submission. All completed forms should be submitted to the Directorate of Examination and Students’ Records (Room 25), Ugbowo Campus. The university emphasised that applicants must make proper enquiries before payment and before filling the forms, as payments are non-refundable.Discover moreEducation Students are also reminded that all completed forms should be submitted only to the Directorate of Examination and Students’ Records and not to any Faculty, School, or Department. However, the university clarified that transfers into the Faculties of Medicine, Pharmacy, Law, Optometry, Dentistry, and the Department of Microbiology will not be accepted for the 2025/2026 academic session. Discover moreEducationShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation Why ASUU Declared a Two-Week Warning Strike UNIBEN Increases Acceptance Fees, Opens Portal for Online Clearance",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/uniben-announces-commencement-of-2025-2026-inter-faculty-and-inter-departmental-transfer-applications/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "Why ASUU Declared a Two-Week Warning Strike",
    "content": "By Theophilus Chibuzo Oliver The Academic Staff Union of Universities (ASUU) has commenced a two-week warning strike following what it described as the Federal Government’s failure to meet its long-standing demands. The union said the decision was reached after several notices and reminders to the government were ignored. ASUU stated that the warning strike is aimed at compelling the government to honour previously signed agreements and address critical issues affecting Nigeria’s public universities. The Seven Key Demands 1. Re-negotiation and Implementation of the 2009 ASUU-FGN Agreement ASUU insists that the Federal Government must either fully implement or renegotiate the 2009 Agreement, which covers key areas such as salaries, working conditions, and university autonomy. Many provisions in the agreement remain unfulfilled more than a decade after its signing. 2. Sustainable Funding for Public Universities The union is demanding consistent and predictable funding to fix decayed infrastructure, provide modern teaching and research facilities, and improve hostels and classrooms across campuses. 3. Revitalisation of Universities Closely linked to the funding issue, this demand focuses on the comprehensive renewal of the university system — including academic, administrative, and physical infrastructure — to enhance the quality of education and research. 4. End to the Alleged Victimisation of ASUU Members ASUU has reported cases of intimidation and unfair treatment of its members in some universities, including Lagos State University (LASU), Prince Abubakar Audu University, and the Federal University of Technology, Owerri (FUTO). The union is demanding that such practices be stopped immediately. 5. Payment of Outstanding 25–35% Salary Arrears The union wants the Federal Government to pay all wage-award arrears that were negotiated but remain unpaid. ASUU argues that the delay violates the spirit of previous agreements. 6. Settlement of Promotion Arrears Spanning Over Four Years Many lecturers have reportedly faced delayed or withheld promotions since 2020. ASUU is calling for the immediate settlement of these arrears to boost morale and reward academic productivity. 7. Remittance of Outstanding Third-Party Deductions These are funds deducted from lecturers’ salaries for union dues, cooperatives, and other statutory obligations that the government has allegedly failed to remit. The union says such delays have disrupted welfare and cooperative schemes across campuses. ASUU maintains that the two-week strike is a warning, not a full shutdown, but warns that failure by the Federal Government to act could lead to a prolonged industrial action. Share this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation Ongoing Examinations Suspended As UNIBEN ASUU Begins Two-Week Warning Strike UNIBEN Announces Commencement of 2025/2026 Inter-Faculty and Inter-Departmental Transfer Applications",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/why-asuu-declared-a-two-week-warning-strike/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "Comrades Condemn Sudden Increase in Acceptance Fees",
    "content": "By David Simeon The University of Benin Comrades Community isn’t holding back. They are calling on the university management to reverse the recent hike in the acceptance fee for fresh students, describing it as unjust, surreptitious, and against the values the institution stands for. In a press released on Sunday, November 2, 2025, the student group expressed deep frustration, labelling the fee hike “arbitrary” and criticising the management for failing to inform students before the commencement of Post-UTME registration. Families had planned for one amount, only to be confronted with a sudden increase after purchasing the forms.Discover moreeducationaleducationEducation The group argued that the move disregards the harsh economic reality most Nigerian families face and breaks the trust of applicants who relied on the original fee. They maintained that public institutions should act in good faith and be transparent—especially in decisions that directly affect people financially. By keeping the fee change under wraps until after students bought their Post-UTME forms, the university, according to the group, misled applicants and trapped them into a deal under false pretences. They described it as a decision that erodes trust and reflects a lack of accountability. The students further stressed that education should not be treated as a privilege but as a right—protected under Section 18 of the 1999 Constitution. Turning it into something only the wealthy can afford, they warned, widens the gap between rich and poor. They also accused public universities of placing profit above fairness. Beyond expressing displeasure, the group demanded swift action. They called on the Minister of Education to intervene and urged Edo State Governor Godwin Obaseki to engage the university management on behalf of affected students and their families. They also appealed directly to President Bola Ahmed Tinubu to uphold the values that both the university and the nation are meant to represent.Discover moreeducationalEducationeducation The Comrades Community reaffirmed their solidarity with all students and parents impacted by the new fee and demanded that the university reverse the increase immediately. Copies of their statement were sent to the Minister of Education, the Edo State Governor, and other relevant authorities. UNIBEN Comrades Community (UCC) For and on behalf of the students and prospective students of the University of Benin. Discover moreeducationaleducationEducationShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATEDiscover moreeducationaleducationEducation function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation UNIBEN Student Alleges Secret Recording and TikTok Upload Without Consent",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/comrades-condemn-sudden-increase-in-acceptance-fees/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "UNIBEN Student Alleges Secret Recording and TikTok Upload Without Consent",
    "content": "By Theophilus Chibuzo Oliver As concerns about online privacy and consent continue to grow, a student of the University of Benin has accused a recent graduate of the institution of secretly recording her and uploading the footage to TikTok without her permission, sparking legal and ethical discussions within the university community. The incident reportedly occurred on 14 October 2025, at about 4 p.m., near Festus Iyayi Hall.Discover moreEducationeducationalTikTokvideosVideovideo Speaking with ACJ UNIBEN, Miss Victoria Ebadan recounted that she was walking towards the Faculty of Life Sciences when a young man approached her and initiated a conversation. According to her, “He walked past me, stopped, and asked me to wait. He then asked if I was familiar with places on campus. I asked where exactly he was looking for, and he replied, ‘Where I can get your number,’ which I found funny and laughed.” Miss Ebadan said she walked away, clearly demonstrating that she was not interested in continuing the conversation. However, the man followed her, asking further questions about her name and how her day was going. “I told him my name was Victoria and walked away. As I was leaving, he said, ‘Take good care,’ not knowing he was recording me with his smart glasses,” she added. The footage was later uploaded to TikTok by the user ‘David Greene’ with the caption, “Not every laugh guarantees chasin’…”. The video quickly attracted attention and generated a series of derogatory comments from viewers. Miss Ebadan said she became aware of the video when a friend informed her about it. She later confronted the individual during her sign-out celebration on 17 October 2025, demanding that he take down the post or face legal action. “He initially claimed that he was within his rights, but as people gathered around, he eventually agreed to delete it,” she said. However, he reportedly failed to comply with other demands issued through her legal counsel.Discover morevideosTikTokVideoEducationvideoeducational Following legal consultation, a formal letter was sent to the accused, outlining several demands. The letter required that he immediately and permanently remove the said video from his TikTok account, @davis_greene001, and from any other platform where it had been uploaded, with written confirmation of compliance within 24 hours. It further demanded that he provide a written undertaking not to publish or republish the video, any portion of it, or any other video of Miss Ebadan without her express written consent. In addition, the accused was instructed to issue a written apology acknowledging the distress caused by his actions, to be posted in a mutually agreed manner—such as a pinned post on his TikTok account. He was also asked to confirm whether the video had been shared, downloaded, or reposted by others, and to outline the steps he had taken to ensure its removal from all platforms. The accused has reportedly deleted the video but has not fulfilled the other demands. Miss Ebadan stated that she intends to pursue further legal action should he fail to comply fully.Discover morevideosEducationeducationalvideoVideoTikTok When ACJ UNIBEN reached out to the accused individual for his response, he did not reply to messages seeking his side of the story as at the time of filing this report. The incident has reignited conversations on digital consent and online ethics, with students and media advocates stressing the need to seek explicit permission before recording or sharing images and videos of others on social media platforms. Share this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Discover morevideoseducationalVideovideoEducationTikTokLike this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Post navigation Fee Hike: UNIBEN Warns New Students to Pay Acceptance Fee Before November 10 or Forfeit Admission Comrades Condemn Sudden Increase in Acceptance Fees",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/uniben-student-alleges-secret-recording-and-tiktok-upload-without-consent/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "Fee Hike: UNIBEN Warns New Students to Pay Acceptance Fee Before November 10 or Forfeit Admission",
    "content": "By Theophilus Chibuzo Oliver The University of Benin (UNIBEN) has issued a stern warning to newly admitted students to complete payment of their acceptance fees on or before Monday, November 10, 2025, or risk losing their admission. In a statement released on Friday, the university emphasised that admitted candidates must strictly adhere to the directive to avoid forfeiture of their admission offers.Discover moreEducationeducational Discover moreeducationalEducation “Admitted candidates are strongly advised to strictly comply with this directive, as the deadline for payment of acceptance charges is Monday, November 10, 2025. Discover moreEducationeducationalAny candidate who fails to complete the acceptance process on or before the deadline shall forfeit the admission offer, and such vacancies will be allocated to qualified candidates on the waiting list,” the statement read. The announcement comes amid concerns over recent fee adjustments in the institution, which have sparked reactions among students and parents. UNIBEN reiterated that only candidates who have paid their acceptance fees and completed other admission formalities will be recognised as bona fide students for the 2024/2025 academic session. Discover moreeducationalEducationShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Discover moreeducationalEducation Post navigation UNIBEN INTRODUCES PRACTICAL AUTOMOBILE ENGINEERING TRAINING FOR STUDENTS UNIBEN Student Alleges Secret Recording and TikTok Upload Without Consent",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/fee-hike-uniben-warns-new-students-to-pay-acceptance-fee-before-november-10-or-forfeit-admission/",
    "source": "https://www.acjuniben.com/"
  },
  {
    "heading": "UNIBEN INTRODUCES PRACTICAL AUTOMOBILE ENGINEERING TRAINING FOR STUDENTS",
    "content": "By Igbinosa Rhoda The University of Benin has commenced a specialised automobile engineering training designed to equip students with practical industry-ready skills in vehicle servicing, diagnostics, and maintenance. This was contained in a communique released on Wednesday by Dr. Benedicta Ehanire, the Public Relations Officer of the University. The programme, titled Fundamentals of Automobile Service and Periodic Maintenance Training, is an initiative of the University’s Vocational and Technical Training Programme (VTTP). It is a direct implementation of the Vice Chancellor’s Five-Point Agenda aimed at repositioning UNIBEN as a centre for vocational excellence and entrepreneurial skill development.Discover moreEducation Speaking at the official launch, the Vice Chancellor, Professor Edoba B. Omoregie, SAN, noted that modern universities must evolve beyond theory-based instruction. He emphasised that integrating vocational competencies into academic programmes is essential for preparing graduates for the realities of the job market. “The future of higher education in Nigeria is skill-driven,” he said. “Our goal is to empower students with technical expertise that enhances employability, drives innovation, and positions them as job creators rather than job seekers.” The phase of the training is targeted at undergraduate engineering students and is being facilitated by seasoned professionals and industry experts. Participants will undergo intensive hands-on sessions in automobile maintenance procedures, fault diagnosis, and modern service techniques. According to the VTTP coordinator, Professor Andrew Amenaghawon, the initiative is part of the university’s commitment to bridging the gap between academic knowledge and practical application. He commended the university management for supporting programmes that promote technical proficiency and entrepreneurial growth.Discover moreEducation The Vocational and Technical Training Programme is one of UNIBEN’s strategic vehicles for promoting youth empowerment, aligning with national objectives on capacity building and sustainable economic development. Discover moreEducationShare this: Click to email a link to a friend (Opens in new window) Email Share Click to share on Telegram (Opens in new window) Telegram Click to share on WhatsApp (Opens in new window) WhatsApp Like this:Like Loading...Support ACJ UNIBEN's goal of always bringing truth to light.Excellent campus journalism requires financial support. Yet, it is this very journalism that contributes to an informed campus community, transparency in educational institutions, and an engaged student body. To continue offering free access to top-notch campus journalism, we invite you to consider making a modest contribution to this worthwhile endeavor. Your support for ACJ UNIBEN's campus journalism ensures its relevance and availability to all students, free of charge, fostering an informed and active campus community.DONATE function pinIt() { var e = document.createElement('script'); e.setAttribute('type','text/javascript'); e.setAttribute('charset','UTF-8'); e.setAttribute('src','https://assets.pinterest.com/js/pinmarklet.js?r='+Math.random()*99999999); document.body.appendChild(e); } Discover moreEducation Post navigation UNIBEN Increases Acceptance Fees, Opens Portal for Online Clearance Fee Hike: UNIBEN Warns New Students to Pay Acceptance Fee Before November 10 or Forfeit Admission",
    "imageUrl": "https://www.acjuniben.com/wp-content/uploads/2023/04/cropped-THE-ACJ-UNNIBEN_prev_ui.png",
    "link": "https://www.acjuniben.com/uniben-introduces-practical-automobile-engineering-training-for-students/",
    "source": "https://www.acjuniben.com/"
  }
]